###############################################################
#  Generated by:      Cadence Innovus 18.10-p002_1
#  OS:                Linux x86_64(Host ID eda-1.EECS.Berkeley.EDU)
#  Generated on:      Sun May  3 10:58:36 2020
#  Design:            clb_tile
#  Command:           write_db post_scale_final_gds
###############################################################
current_design clb_tile
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 1000.000000 -waveform {0.000000 500.000000}
create_clock [get_ports {cfg_clk}]  -name cfg_clk -period 10000.000000 -waveform {0.000000 5000.000000}
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[19]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[19]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[18]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[18]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[17]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[17]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[16]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[16]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[15]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[15]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[14]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[14]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[13]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[13]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[12]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[12]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[11]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[11]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[10]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[10]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[9]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[9]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[8]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[8]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[7]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[7]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[6]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[6]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[5]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[5]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[4]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[4]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[3]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[3]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[2]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[2]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[1]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[1]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0n[0]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0n[0]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[19]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[19]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[18]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[18]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[17]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[17]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[16]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[16]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[15]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[15]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[14]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[14]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[13]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[13]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[12]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[12]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[11]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[11]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[10]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[10]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[9]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[9]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[8]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[8]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[7]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[7]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[6]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[6]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[5]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[5]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[4]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[4]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[3]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[3]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[2]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[2]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[1]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[1]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0y0s[0]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0y0s[0]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[19]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[19]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[18]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[18]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[17]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[17]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[16]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[16]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[15]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[15]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[14]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[14]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[13]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[13]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[12]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[12]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[11]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[11]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[10]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[10]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[9]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[9]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[8]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[8]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[7]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[7]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[6]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[6]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[5]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[5]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[4]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[4]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[3]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[3]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[2]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[2]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[1]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[1]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1e[0]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1e[0]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[19]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[19]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[18]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[18]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[17]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[17]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[16]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[16]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[15]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[15]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[14]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[14]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[13]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[13]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[12]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[12]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[11]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[11]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[10]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[10]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[9]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[9]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[8]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[8]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[7]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[7]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[6]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[6]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[5]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[5]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[4]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[4]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[3]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[3]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[2]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[2]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[1]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[1]}]
set_load -pin_load -max  1  [get_ports {arc_L1_x0v1w[0]}]
set_load -pin_load -min  1  [get_ports {arc_L1_x0v1w[0]}]
set_load -pin_load -max  1  [get_ports {cfg_scan_out}]
set_load -pin_load -min  1  [get_ports {cfg_scan_out}]
set_clock_uncertainty 100 [get_clocks {cfg_clk}]
set_clock_uncertainty 10 [get_clocks {clk}]
